{
  "title": "Free Chee First Term Lookback",
  "intro": "As we finish up the 4th year of the league, the committee thought it prudent to lookback and\nsummarize the first four years of the league and grade everyone’s performance. We’ll be\ncomparing each league owner to a US president. Given the accusations of bias from\ncertain corners of the league, we devoted some time to developing a proprietary algorithm\nto properly rank these teams. Chat “Chuck G” GPT assisted with the math here. The\nalgorithm is like the old BCS formula in that its on a scale of 0-1 and is sure to infuriate\nsome people.\nWithout further ado, let’s discuss the basics of said algorithm. Each team is assigned a\nPower Score that combines regular season performance, scoring strength, playoff resume\nand historical shame for finishing in last place.\nEach stat is normalized so the different scales are comparable and then the formula\nweights them as follows:\n• Win Percentage- 40%\no Regular season only. We’re not giving double credit for playoff wins.\n• Points For- 35%\n• Point Differential- 5%\no Strong defense deserves a little boost\n• Playoff Success- 30%\no 3 points per championship\no 2 points per finals appearance\no 1 per semifinal appearance\n• Penalty for last place finishes\nAll of the above is combined into a single Power Score, which determines the rankings. The\nresults reward scholars. Please see the far right column. (Note: Zaukas and Boyle had a tie\nso there’s one less game for them)",
  "entries": [
    {
      "rank": 1,
      "owner": "Sweeney",
      "power_score": 0.847,
      "writeup": "Sweeney’s metrics are strong all the way around. He has three finals appearances in four\nyears with two championships to show for it. After sneaking in as the last team in the field\nthis year, he thrashed the juggernaut Scampi and rolled to the title. Some would call him\nthe most clutch performer in the league given his win percentage is tied for 5th best and\npoints for are 8th best. He knows how to peak at the right time. That’s the sign of a great\ncoach.\nComparison: FDR. Like Franklin Delano, Sweeney has been clutch when it matters most.\nWhile FDR weathered the Depression and World War Two, Sweeney has delivered clutch\nvictories when facing elimination like his 5 straight wins to end the season this year. Neither\nof them compiled stats in peacetime, they both dominated in high stakes situations.",
      "comparison": "FDR. Like Franklin Delano, Sweeney has been clutch when it matters most.\nWhile FDR weathered the Depression and World War Two, Sweeney has delivered clutch\nvictories when facing elimination like his 5 straight wins to end the season this year. Neither\nof them compiled stats in peacetime, they both dominated in high stakes situations."
    },
    {
      "rank": 2,
      "owner": "Deez",
      "power_score": 0.817,
      "writeup": "Deez has claimed one championship and another appearance in the semifinals but unlike\nSweeney his regular season dominance is the main reason for his being ranked so high.\nDeez sports the highest win percentage in the league through four years with the 3rd most\npoints for. He’s an offensive juggernaut who knows how to win games. While he was\ndisappointed with his finish in 2025, there’s no doubt he’ll remain a fearsome opponent\ngoing forward.\nComparison: Dwight “Deez” Eisenhower. Eisenhower and Deez both displayed calm,\nsustained dominance without chaos. Eisenhower presided over a clean stretch of\neconomic growth in the 1950s which maps favorably onto Deez’s strong regular season\nperformance year over year. Neither’s resume is built on flashy moments, just doing the\nsmall things day in and day out.",
      "comparison": "Dwight “Deez” Eisenhower. Eisenhower and Deez both displayed calm,\nsustained dominance without chaos. Eisenhower presided over a clean stretch of\neconomic growth in the 1950s which maps favorably onto Deez’s strong regular season\nperformance year over year. Neither’s resume is built on flashy moments, just doing the\nsmall things day in and day out."
    },
    {
      "rank": 3,
      "owner": "Ron",
      "power_score": 0.803,
      "writeup": "If just one of his three title game appearances had gone his way, Ron would be the clear #1\nin these ratings. As it sits, he looks like the early 90s Bills with three championship\nappearances and no titles. However, his resume is strong even without a championship.\nHis three title game appearances match Sweeney’s for most in the league. He’s the only\nhuman to have made the playoffs in all four seasons. He’s tied for 3rd in win percentage and\nsits 4th in points for. Elite roster management will continue to be his calling card.\n\nComparison: Gerald Ford. Ford and Ron both have kept things stable but didn’t quite get\nthe crowning validation of a title. Ford ascended to the Presidency but was never elected\nhimself while Ron has reached the championship three times without claiming the crown.\nRon mimics Gerald’s steady, competent leadership.",
      "comparison": "Gerald Ford. Ford and Ron both have kept things stable but didn’t quite get\nthe crowning validation of a title. Ford ascended to the Presidency but was never elected\nhimself while Ron has reached the championship three times without claiming the crown.\nRon mimics Gerald’s steady, competent leadership."
    },
    {
      "rank": 4,
      "owner": "Mitch",
      "power_score": 0.724,
      "writeup": "Often compared to Nostradamus, Mitch can see around corners. It has led to three playoff\nappearances in four years and one title with a team that peaked at the perfect time last\nyear. He is tied with Ron for 3rd best winning percentage and is 6th in points for. He often\nrelies on the stars and scrubs strategy which can backfire when executed poorly. While a\ncut below the top three, he is firmly in 4th place here as nobody below him even has a\nchampionship appearance.\nComparison: George H. W. Bush. Mitch’s legacy is built around one big defining win similar\nto Bush. Bush’s legacy hinges on the undeniable success of Operation Desert Storm. He\ndidn’t dominate in all aspects but this one accomplishment is something history can’t take\naway and that’s how many view Mitch’s championship in 2024. Hasn’t always been\ndominant but he’s overall pretty solid with one crowning achievement.",
      "comparison": "George H. W. Bush. Mitch’s legacy is built around one big defining win similar\nto Bush. Bush’s legacy hinges on the undeniable success of Operation Desert Storm. He\ndidn’t dominate in all aspects but this one accomplishment is something history can’t take\naway and that’s how many view Mitch’s championship in 2024. Hasn’t always been\ndominant but he’s overall pretty solid with one crowning achievement."
    },
    {
      "rank": 5,
      "owner": "TJ",
      "power_score": 0.614,
      "writeup": "TJ has had some strong teams but luck hasn’t gone his way when it matters most. With\nthree playoff appearances and the 2nd most points for, you’d think he would have better\nthan just one semifinal appearance. Still, he’s tied for 5th in winning percentage is one of\nonly six humans to have made the playoffs three times. He won’t be firing his GM anytime\nsoon.\nComparison: James K. Polk. Polk profiles as a president who was very productive but\nsomehow still feels a little underappreciated. Polk dramatically expanded US territory with\nthe resounding victory in the Mexican-American War. He also negotiated with Britain\nresulting in the Oregon Treaty of 1846. This maps well to TJ’s dominance in points for (2nd\nmost in the league) and his top-5 win percentage with three playoff appearances. Neither is\namong the most celebrated of their cohort, as each are less decorated than their stats\nwould suggest.",
      "comparison": "James K. Polk. Polk profiles as a president who was very productive but\nsomehow still feels a little underappreciated. Polk dramatically expanded US territory with\nthe resounding victory in the Mexican-American War. He also negotiated with Britain\nresulting in the Oregon Treaty of 1846. This maps well to TJ’s dominance in points for (2nd\nmost in the league) and his top-5 win percentage with three playoff appearances. Neither is\namong the most celebrated of their cohort, as each are less decorated than their stats\nwould suggest."
    },
    {
      "rank": 6,
      "owner": "Joey",
      "power_score": 0.58,
      "writeup": "Oh man he is going to be PISSED when he sees this. Joey has two playoff berths and one\nsemifinal in four years. He has the most points for in the league. And yet his winning\npercentage is under .500. He has the most points in the league and has the 11th best\nwinning percentage. Let’s do a quick comparison. Ron is similar to Josh Allen. He balls out\n\nevery year, puts the team in a position to win and has had some bad luck in big games\nwhich leads to him having no championships. Mitch is like Jalen Hurts. He’s been mostly\ngood not great, and has one title because a super team with unbelievable talent carried\nhim to the title. Joey is like Lamar Jackson. He puts up lots of points, the fans love him and\neach preseason bettors shower him with love. But when it comes down to it he isn’t very\nclutch.\nAgain as a reminder, he has the most points for in the league over four years and his record\nis 27-29 in the regular season. I’d say he needs a new defensive coordinator but he’s only\n6th in points against.\nComparison: Woodrow Wilson. Wilson talked big and swung for the fences on big projects\nlike the League of Nations, but the results didn’t fully pan out. Similarly, Joey’s rosters and\nambitions have often warranted some big talk but the final results haven’t necessarily lived\nup to their initial billing.",
      "comparison": "Woodrow Wilson. Wilson talked big and swung for the fences on big projects\nlike the League of Nations, but the results didn’t fully pan out. Similarly, Joey’s rosters and\nambitions have often warranted some big talk but the final results haven’t necessarily lived\nup to their initial billing."
    },
    {
      "rank": 7,
      "owner": "Chris",
      "power_score": 0.509,
      "writeup": "Chris is a good solid playoff contender most years. He’s only .500, but sits with the 2nd most\npoints against and the 5th most points for. With marginal defensive improvement, his win\npercentage could tick up significantly. Given the way Ron and Sweeney have hogged chip\nappearances, two playoffs and one semifinal is about right for the 7th rated team in the\nleague.\nComparison: James Madison. Madison was smart, capable and the architect of some\nmajor US systems. Even people who don’t rank him among the best presidents must\nacknowledge he was solidly above average. That’s Chris to a tee. Solid metrics, competitive\nall the time, and a consummate professional.",
      "comparison": "James Madison. Madison was smart, capable and the architect of some\nmajor US systems. Even people who don’t rank him among the best presidents must\nacknowledge he was solidly above average. That’s Chris to a tee. Solid metrics, competitive\nall the time, and a consummate professional."
    },
    {
      "rank": 8,
      "owner": "Gallo",
      "power_score": 0.0452,
      "writeup": "Gallo has the 2nd best winning percentage in the league, but he’s docked some because it’s\nmostly due to having the fewest points against in the league. He’s 9th in points for and\ncommitted the cardinal sin of coming in last. Our formula despises those who come in last\nso he falls at least a couple spots due to that. Still he’s got the best point differential in the\nleague so deserves some credit.\nComparison: William Henry Harrison. Harrison’s profile is technically successful. He has a\nsolid resume and he won the presidency in a clean election, but he died a month into\noffice. Think of that death as equivalent to Gallo’s last place finish. If either Harrison or\nGallo didn’t have that one black mark against them, they might be considered among the\ngreats.",
      "comparison": "William Henry Harrison. Harrison’s profile is technically successful. He has a\nsolid resume and he won the presidency in a clean election, but he died a month into\noffice. Think of that death as equivalent to Gallo’s last place finish. If either Harrison or\nGallo didn’t have that one black mark against them, they might be considered among the\ngreats."
    },
    {
      "rank": 9,
      "owner": "Ger",
      "power_score": 0.417,
      "writeup": "It’s hard for people to forget the infamous Tyreek incident. Some would even call it defining\nmoment of Ger’s first term. Even still, he’s been able to scratch together the 7th best\nwinning percentage in the league. His good defense tactics have allowed him to face the 2nd\nfewest points against. He’s also been quite active on the waiver wire as he has 134 moves\nacross four years which is the 2nd most in the league. Credit him.\nComparison: Lyndon Baines Johnson. LBJ was hyperactive, very deal driven and often\npulling strings behind the scenes. Similarly, Ger is extremely active on the wire with the 2nd\nmost moves in the league. His desire to constantly churn the roster and keep his team in\nflux is akin to LBJ’s style of governance.",
      "comparison": "Lyndon Baines Johnson. LBJ was hyperactive, very deal driven and often\npulling strings behind the scenes. Similarly, Ger is extremely active on the wire with the 2nd\nmost moves in the league. His desire to constantly churn the roster and keep his team in\nflux is akin to LBJ’s style of governance."
    },
    {
      "rank": 10,
      "owner": "TK",
      "power_score": 0.371,
      "writeup": "TK is tied with Ger for 7th best winning percentage despite having the 5th worst point\ndifferential in the league. Our analysts say when he wins he wins small, but when he loses\nhe loses big. Profound analysis from them, right? The thing the committee remembers\nmost from TK was his absolute fleecing of Boyle in our inaugural season of 2022. People\nforget, but TK had the wherewithal to send Javonte Williams and Michael Pittman to Boyle\nin return for Derek Carr, a rookie Amon-Ra St. Brown, Nyheim Hines and Robert “Bobby\nTrees” Woods. Some were up in arms accusing Boyle of rigging the league and calling TK a\n“retarded pussy” but he held strong in his belief. He ended up losing to eventual champion\nSweeney by .02 in the quarterfinals.\nComparison: Rutherford B. Hayes. Hayes lost the popular vote and became president in a\nrazor thin result which is why he’s famous for winning small. Hayes’ presidency was\nessentially decided by recounts and disputed electors while most of TK’s wins end up\nhappening in a similar vein. He eeks out 85-82 victories in the spirit of Rutherford B. but\nwhen he loses he ends up getting clobbered. Additionally, they’re both remembered for one\nbig event. For Hayes, it’s the Compromise of 1877 which ended Reconstruction in the\nSouth in return for the Democrats accepting him as president. For TK, it’s his fleecing of\nBoyle in one of the great trades in league history.",
      "comparison": "Rutherford B. Hayes. Hayes lost the popular vote and became president in a\nrazor thin result which is why he’s famous for winning small. Hayes’ presidency was\nessentially decided by recounts and disputed electors while most of TK’s wins end up\nhappening in a similar vein. He eeks out 85-82 victories in the spirit of Rutherford B. but\nwhen he loses he ends up getting clobbered. Additionally, they’re both remembered for one\nbig event. For Hayes, it’s the Compromise of 1877 which ended Reconstruction in the\nSouth in return for the Democrats accepting him as president. For TK, it’s his fleecing of\nBoyle in one of the great trades in league history."
    },
    {
      "rank": 11,
      "owner": "Justin",
      "power_score": 0.283,
      "writeup": "Justin has had one very good team in four years. Sadly, they didn’t turn it up at playoff time\nand he lost in the first round. He’s 26-30 (46% win pct) so much closer to the middle of the\npack than the cellar dwellers that we are about to discuss. Credit him for never coming in\nlast. Great coaches know how to get their teams to buck up when they’re at risk.\n\nComparison: James Garfield. Garfield didn’t have a long presidency but while active he\nwas generally agreed to be legitimately competent. Justin hasn’t stacked up victories year\nafter year but he has shown one stretch of extremely strong play in 2024. Garfield and\nJustin’s resumes aren’t empty, they just fall short of the elite tier.",
      "comparison": "James Garfield. Garfield didn’t have a long presidency but while active he\nwas generally agreed to be legitimately competent. Justin hasn’t stacked up victories year\nafter year but he has shown one stretch of extremely strong play in 2024. Garfield and\nJustin’s resumes aren’t empty, they just fall short of the elite tier."
    },
    {
      "rank": 12,
      "owner": "Papi",
      "power_score": 0.213,
      "writeup": "Papi actually sits above .500 at 29-27 but two last place finishes kill him. He’s 7th in points\nfor, has a positive point differential and two playoff appearances.  What really kills him is\nthe year he finished 7-7 but came in last. That’s the type of stuff you just can’t do.\nComparison: Andrew Johnson. The record on paper isn’t awful but the legacy is defined by\nthe lows. Andrew Johnson technically didn’t do nothing. He had some competent\nstretches, but he’ll always be defined by his mismanagement of Reconstruction and his\nimpeachment. Those massive negatives are Papi’s two last place finishes. Despite mostly\nadequate management, those last place finishes are like an anchor on Papi’s legacy to this\npoint.",
      "comparison": "Andrew Johnson. The record on paper isn’t awful but the legacy is defined by\nthe lows. Andrew Johnson technically didn’t do nothing. He had some competent\nstretches, but he’ll always be defined by his mismanagement of Reconstruction and his\nimpeachment. Those massive negatives are Papi’s two last place finishes. Despite mostly\nadequate management, those last place finishes are like an anchor on Papi’s legacy to this\npoint."
    },
    {
      "rank": 13,
      "owner": "Boyle",
      "power_score": 0.198,
      "writeup": "Here’s where we really start to get into the dogshit teams. Boyle is 13th with a winning\npercentage of .400. That’s 22-33. He has one playoff appearance. He’s scored the 3rd\nfewest points in the league and he has the 3rd worst point differential. It’s been a bad\nfootball team. And the best part is he knows it. With 190 moves, he has 56 more moves\nthan the next closest guy (Ger). Every week he wakes up quaking in his boots on the waiver\nwire and just spams pickups of abysmal players hoping they’ll rescue him. I guess he’s\nnever come in at last at least, right?\nComparison: Herbert Hoover. The numbers are just ugly. Hoover’s presidency was marred\nby disastrous economic performance with brutal headlines (unemployment, bank failures,\nGDP collapse) which all happened on his watch. Similarly, Boyle’s headlines are scrambled\nass. He has a bad record, bad points scored, bad point differential and one playoff\nappearance. We can try to talk nuance for Hoover and Boyle but the numbers are just\nrough.",
      "comparison": "Herbert Hoover. The numbers are just ugly. Hoover’s presidency was marred\nby disastrous economic performance with brutal headlines (unemployment, bank failures,\nGDP collapse) which all happened on his watch. Similarly, Boyle’s headlines are scrambled\nass. He has a bad record, bad points scored, bad point differential and one playoff\nappearance. We can try to talk nuance for Hoover and Boyle but the numbers are just\nrough."
    },
    {
      "rank": 14,
      "owner": "Connor",
      "power_score": 0.179,
      "writeup": "At 22-34, Connor is just behind Boyle in win percentage. He’s 13th in points for. And he has\nnever made the playoffs. One of only two members of our society to have never touched\nfoot in the sacred ground that is the playoffs. I guess that happens when you draft Cam\nWard and Geno Smith, right?\n\nObviously the committee remains committed to the highest level of unbiased analysis, but\nwhen the formula spits out a result like this? It feels sort of like this picture.\n\nComparison: Millard Fillmore. Like Fillmore, Connor isn’t the absolute worst. His teams\nare just deeply forgettable. Fillmore never humiliated himself, but he also never had any\nsignature moments we can point to. That’s sort of like Connor’s resume. He’s not\nhistorically awful, but he’s never made the playoffs and has no real highlights to\ncounterbalance the resume. The one major difference is that historians mostly consider\nFillmore’s sleep habits to be highly regular, while Connor is known to get 11-12 hours of\nsleep a day.",
      "comparison": "Millard Fillmore. Like Fillmore, Connor isn’t the absolute worst. His teams\nare just deeply forgettable. Fillmore never humiliated himself, but he also never had any\nsignature moments we can point to. That’s sort of like Connor’s resume. He’s not\nhistorically awful, but he’s never made the playoffs and has no real highlights to\ncounterbalance the resume. The one major difference is that historians mostly consider\nFillmore’s sleep habits to be highly regular, while Connor is known to get 11-12 hours of\nsleep a day."
    },
    {
      "rank": 15,
      "owner": "Zaukas",
      "power_score": 0.017,
      "writeup": "Team has been flat bad. There’s no other way to say it. He has the 2nd worst winning\npercentage in the league at 18-37 (0.33) and the worst point differential. Significantly worse\nthan Mikey. Perhaps the defining moment of his tenure was draft day in 2022, when he\ninfamously asked if we could get more money after spending $131 on Justin Jefferson and\nJa’Marr Chase. While that strategy did not pan out, it showed his dedication to his guys and\nthat’s something the league at large has come to revere.\nComparison: Franklin Pierce. Pierce is consistently ranked among the worst US Presidents\ndue to poor outcomes. Zauaks, like Connor, has never made the playoffs so there’s no real\nwins to point to. We’d like to compare his consistently poor record (18-37) to Franklin\nPierce’s disastrous decision to sign the Kansas-Nebraska Act. This act repealed the\nMissouri Compromise and allowed new territories to adopt slavery. This weak leadership\n\ncost him support in the North. Sadly, many of Zaukas’ fans are abandoning ship after this\nyear’s showing. Preliminary data shows some are adopting new allegiances.",
      "comparison": "Franklin Pierce. Pierce is consistently ranked among the worst US Presidents\ndue to poor outcomes. Zauaks, like Connor, has never made the playoffs so there’s no real\nwins to point to. We’d like to compare his consistently poor record (18-37) to Franklin\nPierce’s disastrous decision to sign the Kansas-Nebraska Act. This act repealed the\nMissouri Compromise and allowed new territories to adopt slavery. This weak leadership\n\ncost him support in the North. Sadly, many of Zaukas’ fans are abandoning ship after this\nyear’s showing. Preliminary data shows some are adopting new allegiances."
    },
    {
      "rank": 16,
      "owner": "Mikey",
      "power_score": 0.127,
      "writeup": "Can we get some credits in the chat? Mikey and Zaukas were close but Mikey’s one last\nplace finish drug him down enough to be 16th. With the fewest points scored and 2nd worst\npoint differential, we can’t say the algorithm is wrong. If he’d actually set his lineup every\nweek, we might have a different result here. As one great philosopher once put it, apathy\ncan be more damaging that incompetence.\nComparison: James Buchanan. Buchanan is consistently ranked among the worst\npresidents. Similar to Mikey’s apathy in setting his lineup, Buchanan’s inability to take\nmeaningful action to stop the Civil War is the biggest criticism against him. So the parallel\nis that both Buchanan and Mikey lost and did so while seeming sort of checked out. At least\nin Mikey’s case he was able to salvage his season and avoid relegation while Buchanan’s\nterm did not end on such a positive note.",
      "comparison": "James Buchanan. Buchanan is consistently ranked among the worst\npresidents. Similar to Mikey’s apathy in setting his lineup, Buchanan’s inability to take\nmeaningful action to stop the Civil War is the biggest criticism against him. So the parallel\nis that both Buchanan and Mikey lost and did so while seeming sort of checked out. At least\nin Mikey’s case he was able to salvage his season and avoid relegation while Buchanan’s\nterm did not end on such a positive note."
    }
  ]
}